[["0",{"pageContent":"H1B Specific Questions-\r\n\r\nQuestion 1. What kind of business does your sponsoring employer (Centric Consulting) do?\r\nSample Answer - Centric is a management consulting firm providing digital consulting, business consulting and technology services. The Company operates in the United States & India and offers services to healthcare, insurance, logistics, retail, and travel sectors.\r\n\r\nQuestion 2. What tasks and duties will you be expected to perform during your stay?\r\nSample Answer – I will be working as a Java Developer and will be managed by a Centric Manager. We will design and test end-user applications through various coding languages, investigate problem areas, improve operations of existing software models, etc. (Response should be based out of Job description in the Petition)\r\n\r\nQuestion 3. Since you are working for a Consulting company, which client will you be working for?","metadata":{"loc":{"lines":{"from":1,"to":9}}}}],["1",{"pageContent":"Question 3. Since you are working for a Consulting company, which client will you be working for?\r\nSample Answer – I will be working with <Client Name> but will be working at Centric Columbus office and will be managed by a Centric Manager. (Response depends on what is mentioned in your petition)\r\n\r\nQuestion 4. What is your highest Qualification?\r\nMention the highest qualification (Also carry degree certificates if asked for a Proof)\r\n\r\nQuestion 5. What skills do you possess that make you an asset to your sponsoring employer?\r\nSample Answer – I have 8 years of experience as a Java Developer in India and have worked with various technology firms in India. Provide details about previous experience and certifications you possess. \r\n\r\nQuestion 6. How will you be compensated by your sponsoring employer/ what will be your salary?\r\nSample Answer – I will be paid $XXX per annum (as mentioned in your petition)\r\n\r\nQuestion 7. Where is your sponsoring employer located?","metadata":{"loc":{"lines":{"from":9,"to":21}}}}],["2",{"pageContent":"Sample Answer – I will be paid $XXX per annum (as mentioned in your petition)\r\n\r\nQuestion 7. Where is your sponsoring employer located?\r\nSample Answer – Centric Consulting is headquartered in Dayton, Ohio, but I will be placed at Columbus, Ohio office (as mentioned in your petition)\r\n\r\nQuestion 8. Do you have a plan to support yourself before you receive your first paycheck?\r\nSample Answer – My employer is going to book my air ticket and will also pay me in advance for food, travel and lodging in the US initially. Besides that, I also possess adequate savings to cover any additional costs until I receive my first paycheck.\r\n\r\nQuestion 9. When do you plan to return to your home country?\r\nSample answer: I will return to India once my H-1B expires if I do not get an extension.\r\n\r\nQuestion 10. Have you traveled or ever lived in any country other than India?","metadata":{"loc":{"lines":{"from":21,"to":32}}}}],["3",{"pageContent":"Sample answer: I will return to India once my H-1B expires if I do not get an extension.\r\n\r\nQuestion 10. Have you traveled or ever lived in any country other than India?\r\nSample answer: I have traveled to <Country Names>, and have not lived in any country other than India (if not lived in other countries)\r\n\r\nH-4 Specific Questions-\r\nQuestion 1. Which visa are you applying for? \r\nSame Answer: H4\r\n\r\nQuestion 2. Where will you live in America? \r\nSample Answer: Provide the name of the town or city you will be residing in the US\r\n\r\nQuestion 3. Do you wish to work in America? \r\nSample Answer: Since I am not authorized to work in the US on H4, I will be taking a break from work until I receive EAD/work permit to work in the US.\r\n\r\nQuestion 4. What are your plans to do in the USA? \r\nSample Answer: Since I will be taking a break from my work, I will be a homemaker, will take care of my spouse and kids, and travel around the beautiful tourist destinations in the US.","metadata":{"loc":{"lines":{"from":32,"to":48}}}}],["4",{"pageContent":"Sample Answer: Since I will be taking a break from my work, I will be a homemaker, will take care of my spouse and kids, and travel around the beautiful tourist destinations in the US.\r\n\r\nQuestion 5. With whom will you reside in the United States?\r\nSample Answer: I will be living with my spouse.\r\n\r\nQuestion 6. Who is going to support you financially in the United States?\r\nSample Answer: My spouse will be supporting me financially in the United States.\r\n\r\nQuestion 7. What was the date of your marriage? For how many years have you been married to your spouse?\r\n<Carry Marriage Certificate>\r\n\r\nQuestion 8. What was the location of your marriage?\r\n<Carry a few Pictures of the marriage (Hard copy)>\r\n\r\nQuestion 9. When did your spouse receive approval for an H1B visa?\r\nProvide the accurate approval date, month and year for an H1B visa. Also carry a copy of Spouse’s H1B Visa, Passport, I-797, Recent Salary Slips.\r\n\r\nQuestion 10. Why did you not attend the H4 visa interview with your spouse?","metadata":{"loc":{"lines":{"from":48,"to":65}}}}],["5",{"pageContent":"Question 10. Why did you not attend the H4 visa interview with your spouse?\r\nProvide an honest reason for why you did not attend this interview with your spouse.\r\n\r\nQuestion 11. How long has the current company employed your spouse?\r\nProvide the accurate month, year and date for which your spouse has been associated with the current company.\r\n\r\nQuestion 12. What is the profession of your spouse?\r\nProvide the details of your spouse's profession and the associate job description.\r\n\r\nQuestion 13. What is the annual income of your spouse?\r\nProvide accurate details and submit proof if asked to.\r\n\r\nQuestion 14. Do you have your spouse's bank statement?\r\nSubmit your spouse's bank statement to the immigration officer.\r\n\r\nQuestion 15. Do you have your child’s birth certificate?\r\nSubmit your child’s birth certificate.\r\n\r\nQuestion 16. Have you scheduled an appointment by yourself?","metadata":{"loc":{"lines":{"from":65,"to":83}}}}],["6",{"pageContent":"Question 15. Do you have your child’s birth certificate?\r\nSubmit your child’s birth certificate.\r\n\r\nQuestion 16. Have you scheduled an appointment by yourself?\r\nDon't hesitate to answer if you didn't make an appointment by yourself. Mention if anyone else has scheduled it for you. Also, state a legitimate reason why you could not schedule an appointment (if asked)\r\n\r\n\r\nH-1B Interview Tips- \r\nHere are some things to keep in mind when preparing for and going through your interview:\r\n1.Speak clearly and confidently.\r\n2.Honesty is the best policy. If you are not sure of the answer to a question, it is far better to say that you don’t know rather than fabricate information.\r\n3.Dress professionally. Immigration officers take everything into account when evaluating candidates for the H-1B visa. Dressing appropriately will go a long way toward helping your case. Avoid wearing shorts, open-toed shoes, and shirts with large brands or words on them.","metadata":{"loc":{"lines":{"from":83,"to":94}}}}],["7",{"pageContent":"4.For Children below age of 14, Carry Photograph as specified by USCIS/VFS.\r\n5.Keep your answers short. Your interview will not last long, so avoid long-winded explanations or anecdotes.\r\n6.Arrive at your interview at least 30 minutes early. Planning for this will help you compensate for any delays you might encounter on the way and help ensure that you are not late for your interview. Being late will not necessarily cause your H-1B to be denied, but it will likely mean that you will have to reschedule your interview.\r\n7.Bring your required documents in a single transparent folder or binder rather than having them loosely stapled or paper clipped.\r\n\r\n--------------------------------------\r\n\r\nAbout Centric Consulting-\r\n\r\nCentric Consulting is a management consulting firm providing business consulting, digital consulting, and technology services. The firm helps companies conquer change, optimize processes, elevate their technology, and compete in a digital world.","metadata":{"loc":{"lines":{"from":95,"to":104}}}}],["8",{"pageContent":"Centric Consulting has a small company feel with global reach and industry expertise. Headquartered in Ohio, with locations across the country and India, the firm leads business transformation efforts, develops and executes on digital strategies, and helps clients prepare for what’s next in tech. \r\n\r\nCentric Consulting has a virtual office model that includes localized business units to allow employees to have a more balanced lifestyle with more flexibility.\r\n\r\nCentric Consulting named Larry English as CEO in June 2023\r\n\r\n\r\nAbout Centric India-\r\nCentric India is located in Gurugram, Haryana.\r\n\r\nHere’s what you don’t have to worry about with Centric India: traveling long hours to meet with overseas account managers, working late to collaborate with offshore teams, or sacrificing quality and efficiency to lower costs.","metadata":{"loc":{"lines":{"from":106,"to":116}}}}],["9",{"pageContent":"Why? Because we are not a company working with an offshore partner or an Indian firm. We are a U.S.-owned and operated company with an office in India – and more than 10 years of experience in providing offshore IT services.\r\n\r\nWhat does that mean for you? Simple. You can keep working with the same people you know, trust, and love within our local business units. And, you can count on receiving the same quality of services you’ve come to expect from us.\r\n\r\nBrian Offenbacher - Vice President of Centric Consulting and Centric India lead\r\n\r\nRohit Gambhir - Centric India Lead Partner\r\n\r\nAnirudh Kejriwal - Centric India Lead Partner\r\n\r\nMichael Glass - Centric India Lead","metadata":{"loc":{"lines":{"from":118,"to":128}}}}]]